Microchip-MPLAB-Harmony/motor_control/apps/bldc_bc_hall_sam_c21/firmware/src/packs/ATSAMC21J18A_DFP/component/hmatrixb.h
#define HMATRIXB_MRCR_RCB0_Pos                _U_(0)                                               /**< (HMATRIXB_MRCR) Remap Command Bit for Master 0 Position */
#define HMATRIXB_MRCR_RCB0_Msk                (_U_(0x1) << HMATRIXB_MRCR_RCB0_Pos)                 /**< (HMATRIXB_MRCR) Remap Command Bit for Master 0 Mask */
#define HMATRIXB_MRCR_RCB0(value)             (HMATRIXB_MRCR_RCB0_Msk & ((value) << HMATRIXB_MRCR_RCB0_Pos))
#define   HMATRIXB_MRCR_RCB0_DIS_Val          _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB0_ENA_Val          _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB0_DIS                (HMATRIXB_MRCR_RCB0_DIS_Val << HMATRIXB_MRCR_RCB0_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB0_ENA                (HMATRIXB_MRCR_RCB0_ENA_Val << HMATRIXB_MRCR_RCB0_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB1_Pos                _U_(1)                                               /**< (HMATRIXB_MRCR) Remap Command Bit for Master 1 Position */
#define HMATRIXB_MRCR_RCB1_Msk                (_U_(0x1) << HMATRIXB_MRCR_RCB1_Pos)                 /**< (HMATRIXB_MRCR) Remap Command Bit for Master 1 Mask */
#define HMATRIXB_MRCR_RCB1(value)             (HMATRIXB_MRCR_RCB1_Msk & ((value) << HMATRIXB_MRCR_RCB1_Pos))
#define   HMATRIXB_MRCR_RCB1_DIS_Val          _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB1_ENA_Val          _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB1_DIS                (HMATRIXB_MRCR_RCB1_DIS_Val << HMATRIXB_MRCR_RCB1_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB1_ENA                (HMATRIXB_MRCR_RCB1_ENA_Val << HMATRIXB_MRCR_RCB1_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB2_Pos                _U_(2)                                               /**< (HMATRIXB_MRCR) Remap Command Bit for Master 2 Position */
#define HMATRIXB_MRCR_RCB2_Msk                (_U_(0x1) << HMATRIXB_MRCR_RCB2_Pos)                 /**< (HMATRIXB_MRCR) Remap Command Bit for Master 2 Mask */
#define HMATRIXB_MRCR_RCB2(value)             (HMATRIXB_MRCR_RCB2_Msk & ((value) << HMATRIXB_MRCR_RCB2_Pos))
#define   HMATRIXB_MRCR_RCB2_DIS_Val          _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB2_ENA_Val          _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB2_DIS                (HMATRIXB_MRCR_RCB2_DIS_Val << HMATRIXB_MRCR_RCB2_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB2_ENA                (HMATRIXB_MRCR_RCB2_ENA_Val << HMATRIXB_MRCR_RCB2_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB3_Pos                _U_(3)                                               /**< (HMATRIXB_MRCR) Remap Command Bit for Master 3 Position */
#define HMATRIXB_MRCR_RCB3_Msk                (_U_(0x1) << HMATRIXB_MRCR_RCB3_Pos)                 /**< (HMATRIXB_MRCR) Remap Command Bit for Master 3 Mask */
#define HMATRIXB_MRCR_RCB3(value)             (HMATRIXB_MRCR_RCB3_Msk & ((value) << HMATRIXB_MRCR_RCB3_Pos))
#define   HMATRIXB_MRCR_RCB3_DIS_Val          _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB3_ENA_Val          _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB3_DIS                (HMATRIXB_MRCR_RCB3_DIS_Val << HMATRIXB_MRCR_RCB3_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB3_ENA                (HMATRIXB_MRCR_RCB3_ENA_Val << HMATRIXB_MRCR_RCB3_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB4_Pos                _U_(4)                                               /**< (HMATRIXB_MRCR) Remap Command Bit for Master 4 Position */
#define HMATRIXB_MRCR_RCB4_Msk                (_U_(0x1) << HMATRIXB_MRCR_RCB4_Pos)                 /**< (HMATRIXB_MRCR) Remap Command Bit for Master 4 Mask */
#define HMATRIXB_MRCR_RCB4(value)             (HMATRIXB_MRCR_RCB4_Msk & ((value) << HMATRIXB_MRCR_RCB4_Pos))
#define   HMATRIXB_MRCR_RCB4_DIS_Val          _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB4_ENA_Val          _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB4_DIS                (HMATRIXB_MRCR_RCB4_DIS_Val << HMATRIXB_MRCR_RCB4_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB4_ENA                (HMATRIXB_MRCR_RCB4_ENA_Val << HMATRIXB_MRCR_RCB4_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB5_Pos                _U_(5)                                               /**< (HMATRIXB_MRCR) Remap Command Bit for Master 5 Position */
#define HMATRIXB_MRCR_RCB5_Msk                (_U_(0x1) << HMATRIXB_MRCR_RCB5_Pos)                 /**< (HMATRIXB_MRCR) Remap Command Bit for Master 5 Mask */
#define HMATRIXB_MRCR_RCB5(value)             (HMATRIXB_MRCR_RCB5_Msk & ((value) << HMATRIXB_MRCR_RCB5_Pos))
#define   HMATRIXB_MRCR_RCB5_DIS_Val          _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB5_ENA_Val          _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB5_DIS                (HMATRIXB_MRCR_RCB5_DIS_Val << HMATRIXB_MRCR_RCB5_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB5_ENA                (HMATRIXB_MRCR_RCB5_ENA_Val << HMATRIXB_MRCR_RCB5_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB6_Pos                _U_(6)                                               /**< (HMATRIXB_MRCR) Remap Command Bit for Master 6 Position */
#define HMATRIXB_MRCR_RCB6_Msk                (_U_(0x1) << HMATRIXB_MRCR_RCB6_Pos)                 /**< (HMATRIXB_MRCR) Remap Command Bit for Master 6 Mask */
#define HMATRIXB_MRCR_RCB6(value)             (HMATRIXB_MRCR_RCB6_Msk & ((value) << HMATRIXB_MRCR_RCB6_Pos))
#define   HMATRIXB_MRCR_RCB6_DIS_Val          _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB6_ENA_Val          _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB6_DIS                (HMATRIXB_MRCR_RCB6_DIS_Val << HMATRIXB_MRCR_RCB6_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB6_ENA                (HMATRIXB_MRCR_RCB6_ENA_Val << HMATRIXB_MRCR_RCB6_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB7_Pos                _U_(7)                                               /**< (HMATRIXB_MRCR) Remap Command Bit for Master 7 Position */
#define HMATRIXB_MRCR_RCB7_Msk                (_U_(0x1) << HMATRIXB_MRCR_RCB7_Pos)                 /**< (HMATRIXB_MRCR) Remap Command Bit for Master 7 Mask */
#define HMATRIXB_MRCR_RCB7(value)             (HMATRIXB_MRCR_RCB7_Msk & ((value) << HMATRIXB_MRCR_RCB7_Pos))
#define   HMATRIXB_MRCR_RCB7_DIS_Val          _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB7_ENA_Val          _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB7_DIS                (HMATRIXB_MRCR_RCB7_DIS_Val << HMATRIXB_MRCR_RCB7_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB7_ENA                (HMATRIXB_MRCR_RCB7_ENA_Val << HMATRIXB_MRCR_RCB7_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB8_Pos                _U_(8)                                               /**< (HMATRIXB_MRCR) Remap Command Bit for Master 8 Position */
#define HMATRIXB_MRCR_RCB8_Msk                (_U_(0x1) << HMATRIXB_MRCR_RCB8_Pos)                 /**< (HMATRIXB_MRCR) Remap Command Bit for Master 8 Mask */
#define HMATRIXB_MRCR_RCB8(value)             (HMATRIXB_MRCR_RCB8_Msk & ((value) << HMATRIXB_MRCR_RCB8_Pos))
#define   HMATRIXB_MRCR_RCB8_DIS_Val          _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB8_ENA_Val          _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB8_DIS                (HMATRIXB_MRCR_RCB8_DIS_Val << HMATRIXB_MRCR_RCB8_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB8_ENA                (HMATRIXB_MRCR_RCB8_ENA_Val << HMATRIXB_MRCR_RCB8_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB9_Pos                _U_(9)                                               /**< (HMATRIXB_MRCR) Remap Command Bit for Master 9 Position */
#define HMATRIXB_MRCR_RCB9_Msk                (_U_(0x1) << HMATRIXB_MRCR_RCB9_Pos)                 /**< (HMATRIXB_MRCR) Remap Command Bit for Master 9 Mask */
#define HMATRIXB_MRCR_RCB9(value)             (HMATRIXB_MRCR_RCB9_Msk & ((value) << HMATRIXB_MRCR_RCB9_Pos))
#define   HMATRIXB_MRCR_RCB9_DIS_Val          _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB9_ENA_Val          _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB9_DIS                (HMATRIXB_MRCR_RCB9_DIS_Val << HMATRIXB_MRCR_RCB9_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB9_ENA                (HMATRIXB_MRCR_RCB9_ENA_Val << HMATRIXB_MRCR_RCB9_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB10_Pos               _U_(10)                                              /**< (HMATRIXB_MRCR) Remap Command Bit for Master 10 Position */
#define HMATRIXB_MRCR_RCB10_Msk               (_U_(0x1) << HMATRIXB_MRCR_RCB10_Pos)                /**< (HMATRIXB_MRCR) Remap Command Bit for Master 10 Mask */
#define HMATRIXB_MRCR_RCB10(value)            (HMATRIXB_MRCR_RCB10_Msk & ((value) << HMATRIXB_MRCR_RCB10_Pos))
#define   HMATRIXB_MRCR_RCB10_DIS_Val         _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB10_ENA_Val         _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB10_DIS               (HMATRIXB_MRCR_RCB10_DIS_Val << HMATRIXB_MRCR_RCB10_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB10_ENA               (HMATRIXB_MRCR_RCB10_ENA_Val << HMATRIXB_MRCR_RCB10_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB11_Pos               _U_(11)                                              /**< (HMATRIXB_MRCR) Remap Command Bit for Master 11 Position */
#define HMATRIXB_MRCR_RCB11_Msk               (_U_(0x1) << HMATRIXB_MRCR_RCB11_Pos)                /**< (HMATRIXB_MRCR) Remap Command Bit for Master 11 Mask */
#define HMATRIXB_MRCR_RCB11(value)            (HMATRIXB_MRCR_RCB11_Msk & ((value) << HMATRIXB_MRCR_RCB11_Pos))
#define   HMATRIXB_MRCR_RCB11_DIS_Val         _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB11_ENA_Val         _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB11_DIS               (HMATRIXB_MRCR_RCB11_DIS_Val << HMATRIXB_MRCR_RCB11_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB11_ENA               (HMATRIXB_MRCR_RCB11_ENA_Val << HMATRIXB_MRCR_RCB11_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB12_Pos               _U_(12)                                              /**< (HMATRIXB_MRCR) Remap Command Bit for Master 12 Position */
#define HMATRIXB_MRCR_RCB12_Msk               (_U_(0x1) << HMATRIXB_MRCR_RCB12_Pos)                /**< (HMATRIXB_MRCR) Remap Command Bit for Master 12 Mask */
#define HMATRIXB_MRCR_RCB12(value)            (HMATRIXB_MRCR_RCB12_Msk & ((value) << HMATRIXB_MRCR_RCB12_Pos))
#define   HMATRIXB_MRCR_RCB12_DIS_Val         _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB12_ENA_Val         _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB12_DIS               (HMATRIXB_MRCR_RCB12_DIS_Val << HMATRIXB_MRCR_RCB12_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB12_ENA               (HMATRIXB_MRCR_RCB12_ENA_Val << HMATRIXB_MRCR_RCB12_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB13_Pos               _U_(13)                                              /**< (HMATRIXB_MRCR) Remap Command Bit for Master 13 Position */
#define HMATRIXB_MRCR_RCB13_Msk               (_U_(0x1) << HMATRIXB_MRCR_RCB13_Pos)                /**< (HMATRIXB_MRCR) Remap Command Bit for Master 13 Mask */
#define HMATRIXB_MRCR_RCB13(value)            (HMATRIXB_MRCR_RCB13_Msk & ((value) << HMATRIXB_MRCR_RCB13_Pos))
#define   HMATRIXB_MRCR_RCB13_DIS_Val         _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB13_ENA_Val         _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB13_DIS               (HMATRIXB_MRCR_RCB13_DIS_Val << HMATRIXB_MRCR_RCB13_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB13_ENA               (HMATRIXB_MRCR_RCB13_ENA_Val << HMATRIXB_MRCR_RCB13_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB14_Pos               _U_(14)                                              /**< (HMATRIXB_MRCR) Remap Command Bit for Master 14 Position */
#define HMATRIXB_MRCR_RCB14_Msk               (_U_(0x1) << HMATRIXB_MRCR_RCB14_Pos)                /**< (HMATRIXB_MRCR) Remap Command Bit for Master 14 Mask */
#define HMATRIXB_MRCR_RCB14(value)            (HMATRIXB_MRCR_RCB14_Msk & ((value) << HMATRIXB_MRCR_RCB14_Pos))
#define   HMATRIXB_MRCR_RCB14_DIS_Val         _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB14_ENA_Val         _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB14_DIS               (HMATRIXB_MRCR_RCB14_DIS_Val << HMATRIXB_MRCR_RCB14_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB14_ENA               (HMATRIXB_MRCR_RCB14_ENA_Val << HMATRIXB_MRCR_RCB14_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB15_Pos               _U_(15)                                              /**< (HMATRIXB_MRCR) Remap Command Bit for Master 15 Position */
#define HMATRIXB_MRCR_RCB15_Msk               (_U_(0x1) << HMATRIXB_MRCR_RCB15_Pos)                /**< (HMATRIXB_MRCR) Remap Command Bit for Master 15 Mask */
#define HMATRIXB_MRCR_RCB15(value)            (HMATRIXB_MRCR_RCB15_Msk & ((value) << HMATRIXB_MRCR_RCB15_Pos))
#define   HMATRIXB_MRCR_RCB15_DIS_Val         _U_(0x0)                                             /**< (HMATRIXB_MRCR) Disable remapped address decoding for master  */
#define   HMATRIXB_MRCR_RCB15_ENA_Val         _U_(0x1)                                             /**< (HMATRIXB_MRCR) Enable remapped address decoding for master  */
#define HMATRIXB_MRCR_RCB15_DIS               (HMATRIXB_MRCR_RCB15_DIS_Val << HMATRIXB_MRCR_RCB15_Pos) /**< (HMATRIXB_MRCR) Disable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_RCB15_ENA               (HMATRIXB_MRCR_RCB15_ENA_Val << HMATRIXB_MRCR_RCB15_Pos) /**< (HMATRIXB_MRCR) Enable remapped address decoding for master Position  */
#define HMATRIXB_MRCR_Msk                     _U_(0x0000FFFF)                                      /**< (HMATRIXB_MRCR) Register Mask  */

